In [1]:
import numpy as np
import pandas as pd
from numpy import random

In [2]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
#defining the dictionary

In [4]:
df = pd.DataFrame(d)#defining a dataframe
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna() #it drop the rows value with no null value means it
# does not drop missing values on row

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(axis=1)# if axis = 1 the it will drop column value axis = 0 is 
#default value

   C
0  1
1  2
2  3

In [7]:
df.dropna(thresh = 2) # it show row 2 cause it has itleast 2 not NaN value.

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

fillna() function is used to fill the missing values

In [10]:
df.fillna(value = 'Fill Value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [11]:
df['A'].fillna(value = df['A'].mean()) # this will fill the mean value of A

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64